#include <ncurses.h>

#define BOARD_DIM 17
#define BOARD_ROWS BOARD_DIM
#define BOARD_COLS BOARD_DIM * 2.5

using namespace std;

WINDOW * win = newwin(30, 30, 20, 20);

char map[21][21] = {
    {2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {1,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,1},
    {2,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,1,2}    
};

void drawMap(WINDOW * win)
{
    for(int i = 0; i < 21; i++){
        for(int j = 0; j < 21; j++)
        {
            char a;
            switch (map[i][j]) {
                case 0:
                    a = ' '; // 빈 공간
                    break;
                case 1:
                    a = '#'; // 벽
                    break;
                case 2:
                    a = '*'; // 특별한 픽셀
                    break;

            }
            mvwprintw(win, i + 10, j + 10, "%c", a);

        }
    }
}
void addAt(WINDOW * win, int y, int x, char ch)
    {
        mvwprintw(win, y, x, "%c", ch);
        wrefresh(win);

    }
int main()
{   
    initscr();
    int xMax, yMax;
    getmaxyx(stdscr, yMax, xMax);    
    WINDOW * win = newwin(BOARD_ROWS + 21, BOARD_COLS + 21, (yMax/2)-(BOARD_ROWS/2), (xMax/2)-(BOARD_COLS/2));
    box(win, 0, 0);  
    drawMap(win);
    refresh(); // 변경점 발생시 변경점 반영
    wrefresh(win); // wrefresh()는 대체로 refresh() 뒤에 오는 것이 좋음
    int key;
    int posX = 5, posY = 5;
    keypad(stdscr, TRUE);

    getch();
    endwin();
}
